"use strict";

/*
Создайте переменную a со значением 10 и переменную b со значением 5. Отнимите от a переменную b и результат присвойте переменной c.
Затем создайте переменную d, присвойте ей значение 7. Сложите переменные c и d, а результат запишите в переменную result. Выведите на экран значение переменной result.
let a= 10;
let b= 5;
let c = a - b;

let d = 7;
let result = c + d;
console.log(result);


==
Перепишите следующий код через вставку переменных:

let str1 = 'xxx';
let str2 = 'yyy';
let txt  = `aaa  ${str1} bbb ${str2} ccc`; 
console.log(txt);

==
let str = `a
b
c`;
console.log(str);

*/
/*
Дана переменная со значением '5px' и переменная со значением '6px'. Найдите сумму пикселей из значений этих переменных и выведите ее на экран.
let num1 = parseInt('5px');
let num2 = parseInt('6px');
let c = num1 + num2;
alert(c + "px");
*/

/*
Дана переменная со значением '5.5px' и переменная со значением '6.25px'. Найдите сумму пикселей из значений этих переменных и выведите ее на экран.

let num1 = parseFloat('5.5px');
let num2 = parseFloat('6.25px');
let c = num1 + num2;
alert(c + "px");
*/


/*
Даны две переменные с числами. Сложите значения этих переменных как строки и выведите результат на экран.
let a = 99;
let b = 66;
alert(String(a) + String(b));
*/

/*
let num = 3456346365423;
console.log(String(num).length);
*/

/*Даны две переменные с числами. Найдите количество цифр в одном и во втором числе, результаты сложите и выведите на экран.

let num1 = 24524;
let num2 = 2452434;
alert(String(num1).length + String(num2).length);
*/

/*
Дана переменная со строкой 'abcde'. Обращаясь к отдельным символам этой строки запишите в новую переменную символы этой строки в обратном порядке, то есть 'edcba'.

let num  = 'abcde';
alert(num[4]+num[3]+num[2]+num[1]+num[0]);
*/

//Дана строка. Выведите на экран ее последний символ.
/*
let str = 'sgsdgsdf';
console.log(str[str.length - 2]);*/

//Дана строка '12345'. Найдите сумму цифр этой строки.
/*
let str = '12345';
console.log(Number(str[0]) + Number(str[1]) +  Number(str[2]) +  Number(str[3]) +  Number(str[4]));
*/

/*
//Дано число 12345. Найдите сумму цифр этого числа.
let str = 12345;
let str1 = String(str);
console.log(Number(str1[0])+ Number(str1[1]));
*/
//Дано число 12345. Найдите произведение цифр этого числа.
/*
let str = 12345;
let str1 = String(str);
console.log(str1[0]*str1[1]*str1[2]);
*/

//Дано число 12345. Переставьте цифры этого числа в обратном порядке.
/*
let str = 12345;
let str1 = String(str);
console.log(Number(str1[4] + str1[3] + str1[2] + str1[1] + str1[0]));
*/

//Пусть дана переменная r с радиусом круга. По соответствующей формуле найдите площадь круга и запишите ее в переменную s. Выведите содержимое этой переменной на экран.
/*
let r = 10;
let p = 3.14;
alert(p*r**2);
*/

//Пусть дана переменная a со стороной квадрата. Найдите площадь квадрата и запишите ее в переменную s. Выведите содержимое этой переменной на экран.
/*
let a = 10;
let s = a**2;
alert(s);
*/

//Пусть даны переменные a и b со сторонами прямоугольника. Найдите площадь прямоугольника и запишите ее в переменную s. Выведите содержимое этой переменной на экран.
/*
let a = 2;
let b = 3;
let s = a**2 + b**2;
alert(s);
*/
//Пусть даны переменные a и b со сторонами прямоугольника. Найдите периметр прямоугольника и запишите его в переменную p. Выведите содержимое этой переменной на экран.
/*
let a = 2;
let b = 3;
let p = a*2 + b*2;
alert(p);
*/
//Пусть дана переменная tc с температурой в градусах Цельсия. По соответствующей формуле выполните перевод этой температуры в градусы Фаренгейта.
/*
let tc = 10;
let b = tc*9/5+32;
alert(b);
*/

//Пусть дана переменная tf с температурой в градусах Фаренгейта. По соответствующей формуле выполните перевод этой температуры в градусы Цельсия.
/*
let tf = 50;
let b = (tf - 32)*5/9
alert(b);
*/
